Revit 2024 API
AnalyticalNodeConnectionStatus Enumeration
 Indicates the Connections Status for an Analytical Node.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum AnalyticalNodeConnectionStatus
Visual Basic
Public Enumeration AnalyticalNodeConnectionStatus
Visual C++
public enum class AnalyticalNodeConnectionStatus
Members
Member name | Description
Unconnected |  Unconnected node (only one connected element)
Connected |  Connected
See Also
Autodesk.Revit.DB.Structure Namespace